frontend/controllers/MahasiswaController.php

  public function actionLists($id){
             $countBranches = Mahasiswa::find()
              ->where(['npm'=>$id])
               ->count();

           $branches = Mahasiswa::find()
          ->where(['npm'=>$id])
               ->all();
---
SELECT COUNT(*) FROM `mahasiswa` WHERE `npm`='331'
SELECT * FROM `mahasiswa` WHERE `npm`='331'