frontend/controllers/SuratController.php

SELECT * FROM `mahasiswa` WHERE `npm`='115'
INSERT INTO `surat` (`tanggal`, `status`, `nama`, `npm`, `tempat`, `perihal`, `tujuan`, `isi`) VALUES ('2018-09-03', 'PENDING', 'isan', '115', '123123', 'INTERNSHIP', '<p>df</p>\r\n', '<p>sg</p>\r\n')
---
    public function actionCreate()
    {
        $model = new Surat();
        $model->tanggal = date("Y-m-d");
        $model->status = "PENDING";

        if ($model->load(Yii::$app->request->post())){
            $nama = Mahasiswa::find()->where([ "npm" => $model->nama ])->asArray()->all();
            $model->nama = $nama[0]['nama'];

            $dataNama =  $nama[0]['nama'];
            $dataEmail =  $nama[0]['email'];
            $dataNpm =  $nama[0]['npm'];
            $dataStatus =  $model->status;

            if ($model->save()){

SELECT * FROM `surat` WHERE `id`='48'
---
    protected function findModel($id)
    {
        if (($model = Surat::findOne($id)) !== null) {