frontend/views/surat/_form.php

SELECT * FROM `mahasiswa`
---
/* @var $this yii\web\View */
/* @var $model frontend\models\Surat */
/* @var $form yii\widgets\ActiveForm */
$nama=Mahasiswa::find()->all();